# -*- coding: utf-8 -*-
# @Time    : 2018/12/7 18:11
# @Author  : lemon_huahua
# @Email   : 204893985@qq.com
# @File    : read_me.py

#ddt的作用
#ddt装饰用例之后 怎么加载用例
#logging的知识模块
#logging的定义和等级 logging的作用  logging的类编写


#周一：晚上9点-10点 logging+smtp

#项目实战阶段的安排:周二 请嗨皮大佬  接口项目实战的需求

#讲师：mango
#讲师经历：详细见PPT
#实战安排模式：
#老师引导写项目代码：老师+学生 合力完成，最后会给代码给大家
#阶段任务考核项目代码：学生自己完成，做考核任务

#学习方式：
#1. 别怕苦别怕累，坚持就是胜利。
#2.不要轻易的被别人影响，走自己的路
#3.没有尝试过就不要说不会，没有努力过也不要责怪任何人，
# 你的时间是你的，你的事情是你的，自己安排。我们只负责答疑解惑，带上愿意学习愿意努力的人。
#这个就跟你跟别人说穷，是因为我没有努力赚钱是一个道理，关人家什么事情？？？？
#
