#!/usr/bin/env python 
# -*- coding:utf-8 -*-
# @Time :2018/12/1 9:12
'''接口分类'''
'''外部  内部  广泛的分类'''
'''安装不同的请求协议http  webservice  dubbo socket'''
'''接口的本质   登录接口 注册接口  获取每个身份天气预报的接口'''
'''类：函数/方法   就是测试类里面的方法'''
'''Apache tomcat 中间件  容器  服务 ----URL地址'''
'''http协议接口  分为 get  post  delete  head  option'''


'''常见状态码'''
'''200：表示一起正常，到了服务器，并且服务器正常响应了请求'''
'''302：指出被请求的文档已被临时移动到别处，此文档的新URL在location响应头中给出'''
'''304：未修改，表示客户机缓存的版本是最新的，客户机应该继续使用它'''
'''403：服务器理解客户端请求，但拒绝处理它。通常服务器上的文件或目录的权限设置所致'''
'''404：服务器上不出众客户机所请求的资源'''
'''500：服务器的CGI、ASP、JSP、等程序发生错误'''
'''504:超时'''

